[
  {
    "title": "Chat with AI: The Surprising Turn of Real-time Video Communication from Human to AI",
    "url": "http://arxiv.org/abs/2507.10510v1",
    "arxiv_id": "2507.10510v1",
    "authors": [
      "Jiangkai Wu",
      "Zhiyuan Ren",
      "Liming Liu",
      "Xinggong Zhang"
    ],
    "published": "2025-07-14T17:34:49+00:00",
    "summary": "AI Video Chat emerges as a new paradigm for Real-time Communication (RTC), where one peer is not a human, but a Multimodal Large Language Model (MLLM). This makes interaction between humans and AI more intuitive, as if chatting face-to-face with a real person. However, this poses significant challenges to latency, because the MLLM inference takes up most of the response time, leaving very little time for video streaming. Due to network uncertainty and instability, transmission latency becomes a critical bottleneck preventing AI from being like a real person. To address this, we propose Artic, an AI-oriented Real-time Communication framework, exploring the network requirement shift from \"humans watching video\" to \"AI understanding video\". To reduce bitrate dramatically while maintaining MLLM accuracy, we propose Context-Aware Video Streaming that recognizes the importance of each video region for chat and allocates bitrate almost exclusively to chat-important regions. To avoid packet retransmission, we propose Loss-Resilient Adaptive Frame Rate that leverages previous frames to substitute for lost/delayed frames while avoiding bitrate waste. To evaluate the impact of video streaming quality on MLLM accuracy, we build the first benchmark, named Degraded Video Understanding Benchmark (DeViBench). Finally, we discuss some open questions and ongoing solutions for AI Video Chat."
  },
  {
    "title": "Referential ambiguity and clarification requests: comparing human and LLM behaviour",
    "url": "http://arxiv.org/abs/2507.10445v1",
    "arxiv_id": "2507.10445v1",
    "authors": [
      "Chris Madge",
      "Matthew Purver",
      "Massimo Poesio"
    ],
    "published": "2025-07-14T16:28:00+00:00",
    "summary": "In this work we examine LLMs' ability to ask clarification questions in task-oriented dialogues that follow the asynchronous instruction-giver/instruction-follower format. We present a new corpus that combines two existing annotations of the Minecraft Dialogue Corpus -- one for reference and ambiguity in reference, and one for SDRT including clarifications -- into a single common format providing the necessary information to experiment with clarifications and their relation to ambiguity. With this corpus we compare LLM actions with original human-generated clarification questions, examining how both humans and LLMs act in the case of ambiguity. We find that there is only a weak link between ambiguity and humans producing clarification questions in these dialogues, and low correlation between humans and LLMs. Humans hardly ever produce clarification questions for referential ambiguity, but often do so for task-based uncertainty. Conversely, LLMs produce more clarification questions for referential ambiguity, but less so for task uncertainty. We question if LLMs' ability to ask clarification questions is predicated on their recent ability to simulate reasoning, and test this with different reasoning approaches, finding that reasoning does appear to increase question frequency and relevancy."
  },
  {
    "title": "Non-exchangeable Conformal Prediction with Optimal Transport: Tackling Distribution Shifts with Unlabeled Data",
    "url": "http://arxiv.org/abs/2507.10425v1",
    "arxiv_id": "2507.10425v1",
    "authors": [
      "Alvaro H. C. Correia",
      "Christos Louizos"
    ],
    "published": "2025-07-14T16:10:55+00:00",
    "summary": "Conformal prediction is a distribution-free uncertainty quantification method that has gained popularity in the machine learning community due to its finite-sample guarantees and ease of use. Its most common variant, dubbed split conformal prediction, is also computationally efficient as it boils down to collecting statistics of the model predictions on some calibration data not yet seen by the model. Nonetheless, these guarantees only hold if the calibration and test data are exchangeable, a condition that is difficult to verify and often violated in practice due to so-called distribution shifts. The literature is rife with methods to mitigate the loss in coverage in this non-exchangeable setting, but these methods require some prior information on the type of distribution shift to be expected at test time. In this work, we study this problem via a new perspective, through the lens of optimal transport, and show that it is possible to estimate the loss in coverage and mitigate it in case of distribution shift."
  },
  {
    "title": "Massive stars advanced evolution: I -- New reaction rates for carbon and oxygen nuclear reactions",
    "url": "http://arxiv.org/abs/2507.10377v1",
    "arxiv_id": "2507.10377v1",
    "authors": [
      "T. Dumont",
      "A. Bonhomme",
      "A. Griffiths",
      "A. Choplin",
      "M. A. Aloy",
      "G. Meynet",
      "K. Godbey",
      "C. Simenel",
      "G. Scamps",
      "F. Castillo",
      "A. Cosoli-Ortega",
      "S. Courtin"
    ],
    "published": "2025-07-14T15:16:46+00:00",
    "summary": "The nuclear rates for reactions involving 12C and 16O are key to compute the energy release and nucleosynthesis of massive stars during their evolution. These rates shape the stellar structure and evolution, and impact the nature of the final compact remnant. We explore the impact of new nuclear reaction rates for 12C({\\alpha},{\\gamma})16O, 12C+12C, 12C+16O and 16O+16O reactions for massive stars. We aim to investigate how the structure and nucleosynthesis evolve and how these processes influence the stellar fate. We computed stellar models using the GENEC code, including updated rates for 12C({\\alpha},{\\gamma})16O and, for the three fusion reactions, new rates following a fusion suppression scenario and new theoretical rates obtained with TDHF calculations. The updated 12C({\\alpha},{\\gamma})16O rates mainly impact the chemical structure evolution changing the 12C/16O ratio with little effect on the CO core mass. This variation in the 12C/16O ratio is critical for predicting the stellar fate, which is very sensitive to 12C abundance. The combined new rates for 12C+12C and 16O+16O fusion reactions according to the HIN(RES) model lead to shorter C- and O-burning lifetimes, and shift the ignition conditions to higher temperatures and densities. Theoretical TDHF rates primarily affect C-burning, increasing its duration and lowering the ignition temperature. These changes alter the core chemical structure, the carbon shell size and duration, and hence the compactness. They also affect nucleosynthesis. This work shows that accurate reaction rates for key processes in massive star evolution drive significant changes in stellar burning lifetimes, chemical evolution, and stellar fate. In addition, discrepancies between experimental and theoretical rates introduce uncertainties in model predictions, influencing both the internal structure and the supernova ejecta composition."
  },
  {
    "title": "Beyond Graph Model: Reliable VLM Fine-Tuning via Random Graph Adapter",
    "url": "http://arxiv.org/abs/2507.10355v1",
    "arxiv_id": "2507.10355v1",
    "authors": [
      "Bo Jiang",
      "Xueyang Ze",
      "Beibei Wang",
      "Xixi Wang",
      "Xixi Wan",
      "Bin Luo"
    ],
    "published": "2025-07-14T14:56:49+00:00",
    "summary": "Textual adapter-based tuning methods have shown significant potential in transferring knowledge from pre-trained Vision-Language Models (VLMs) to downstream tasks. Existing works generally employ the deterministic textual feature adapter to refine each category textual representation. However, due to inherent factors such as different attributes and contexts, there exists significant diversity in textual descriptions for each category. Such description diversity offers rich discriminative semantic knowledge that can benefit downstream visual learning tasks. Obviously, traditional deterministic adapter model cannot adequately capture this varied semantic information. Also, it is desirable to exploit the inter-class relationships in VLM adapter. To address these issues, we propose to exploit random graph model into VLM adapter and develop a novel Vertex Random Graph Adapter (VRGAdapter). VRGAdapter first models the inherent diverse descriptions of each category and inter-class relationships of different categories simultaneously by leveraging a Vertex Random Knowledge Graph (VRKG) model. Then, it employs probabilistic message propagation on VRKG to learn context-aware distribution representation for each class node. Finally, it adopts a reparameterized sampling function to achieve textual adapter learning. Note that, VRGAdapter provides a more general adapter solution that encompasses traditional graph-based adapter as a special case. In addition, to enable more robust performance for downstream tasks, we also introduce a new Uncertainty-guided Multi-branch Fusion (UMF) scheme that dynamically integrates multiple pre-trained models for ensemble prediction. Extensive experiments on multiple benchmark datasets demonstrate the effectiveness of our approach."
  },
  {
    "title": "Gaussian Process Methods for Very Large Astrometric Data Sets",
    "url": "http://arxiv.org/abs/2507.10317v1",
    "arxiv_id": "2507.10317v1",
    "authors": [
      "Timothy Hapitas",
      "Lawrence M. Widrow",
      "Thavisha E. Dharmawardena",
      "Daniel Foreman-Mackey"
    ],
    "published": "2025-07-14T14:25:17+00:00",
    "summary": "We present a novel non-parametric method for inferring smooth models of the mean velocity field and velocity dispersion tensor of the Milky Way from astrometric data. Our approach is based on Stochastic Variational Gaussian Process Regression (SVGPR) and provides an attractive alternative to binning procedures. SVGPR is an approximation to standard GPR, the latter of which suffers severe computational scaling with N and assumes independently distributed Gaussian Noise. In the Galaxy however, velocity measurements exhibit scatter from both observational uncertainty and the intrinsic velocity dispersion of the distribution function. We exploit the factorization property of the objective function in SVGPR to simultaneously model both the mean velocity field and velocity dispersion tensor as separate Gaussian Processes. This achieves a computational complexity of O(M^3) versus GPR's O(N^3), where M << N is a subset of points chosen in a principled way to summarize the data. Applied to a sample of ~8 x 10^5 stars from the Gaia DR3 Radial Velocity Survey, we construct differentiable profiles of the mean velocity and velocity dispersion as functions of height above the Galactic midplane. We find asymmetric features in all three diagonal components of the velocity dispersion tensor, providing evidence that the vertical dynamics of the Milky Way are in a state of disequilibrium. Furthermore, our dispersion profiles exhibit correlated structures at several locations in |z|, which we interpret as signatures of the Gaia phase spiral. These results demonstrate that our method provides a promising direction for data-driven analyses of Galactic dynamics."
  },
  {
    "title": "How an overweight and rapidly rotating PG 1159 star in the Galactic halo challenges evolutionary models",
    "url": "http://arxiv.org/abs/2507.10314v1",
    "arxiv_id": "2507.10314v1",
    "authors": [
      "Nina Mackensen",
      "Nicole Reindl",
      "Klaus Werner",
      "Matti Dorsch",
      "Shuyu Tan"
    ],
    "published": "2025-07-14T14:18:50+00:00",
    "summary": "PG 1159 stars are thought to be progenitors of the majority of H-deficient white dwarfs. Their unusual He-, C-, and O-dominated surface composition is typically believed to result from a late thermal pulse experienced by a single (pre-)white dwarf. Yet, other formation channels - involving close binary evolution - have recently been proposed and could lead to similar surface compositions. Here we present a non-local thermodynamic equilibrium spectral analysis based on new UV and archival optical spectra of one of the hottest PG 1159 stars, $\\text{RX J}0122.9\\text{ -}7521$. We find $T_\\text{eff} = 175$ kK and a surface gravity of log $g = 7.7$, and an astonishingly low O/C ratio of $7.3 \\times 10^{-3}$ by mass. By combining the spectroscopic surface gravity and Gaia parallax with a spectral energy distribution fit, we derive a mass of $M_\\text{spec} = 1.8^{+1.1}_{-0.7}$ $M_\\odot$. Although this spectroscopic mass is higher than predicted by evolutionary models, it is subject to substantial uncertainty. Furthermore, we find that $\\text{RX J}0122.9\\text{ -}7521$ shows strongly rotationally broadened lines, suggesting that the previously reported photometric period of $41$ min indeed corresponds to the rotational period of this star. Our kinematic analysis shows that $\\text{RX J}0122.9\\text{ -}7521$ belongs to the Galactic halo, which - assuming single-star evolution - is in stark contrast to its relatively high mass. The rapid rotation, high mass, and halo kinematics, as well as the lack of evidence for a close companion, lead us to believe that $\\text{RX J}0122.9\\text{ -}7521$ formed through the merger of two white dwarfs. Yet, none of the current models can explain the surface abundances of $\\text{RX J}0122.9\\text{ -}7521$."
  },
  {
    "title": "High Resolution Temperature-Resolved Spectroscopy of the Nitrogen Vacancy $^{1}E$ Singlet State Ionization Energy",
    "url": "http://arxiv.org/abs/2507.10291v1",
    "arxiv_id": "2507.10291v1",
    "authors": [
      "Kristine V. Ung",
      "Connor A. Roncaioli",
      "Ronald L. Walsworth",
      "Sean M. Blakley"
    ],
    "published": "2025-07-14T13:57:37+00:00",
    "summary": "The negatively charged diamond nitrogen-vacancy ($\\mathrm{{NV}^-}$) center plays a central role in many cutting edge quantum sensing applications; despite this, much is still unknown about the energy levels in this system. The ionization energy of the $\\mathrm{^{1}E}$ singlet state in the $\\mathrm{{NV}^-}$ has only recently been measured at between 2.25 eV and 2.33 eV. In this work, we further refine this energy by measuring the $\\mathrm{^{1}E}$ energy as a function of laser wavelength and diamond temperature via magnetically mediated spin-selective photoluminescence (PL) quenching; this PL quenching indicating at what wavelength ionization induces population transfer from the $\\mathrm{^{1}E}$ into the neutral $\\mathrm{{NV}^0}$ charge configuration. Measurements are performed for excitation wavelengths between 450 nm and 470 nm and between 540 nm and 566 nm in increments of 2 nm, and for temperatures ranging from about 50 K to 150 K in 5 K increments. We determine the $\\mathrm{^{1}E}$ ionization energy to be between 2.29 and 2.33 eV, which provides about a two-fold reduction in uncertainty of this quantity. Distribution level: A. Approved for public release; distribution unlimited."
  },
  {
    "title": "History Matching under Uncertainty of Geological Scenarios with Implicit Geological Realism Control with Generative Deep Learning and Graph Convolutions",
    "url": "http://arxiv.org/abs/2507.10201v1",
    "arxiv_id": "2507.10201v1",
    "authors": [
      "Gleb Shishaev",
      "Vasily Demyanov",
      "Daniel Arnold"
    ],
    "published": "2025-07-14T12:14:17+00:00",
    "summary": "The graph-based variational autoencoder represents an architecture that can handle the uncertainty of different geological scenarios, such as depositional or structural, through the concept of a lowerdimensional latent space. The main difference from recent studies is utilisation of a graph-based approach in reservoir modelling instead of the more traditional lattice-based deep learning methods. We provide a solution to implicitly control the geological realism through the latent variables of a generative model and Geodesic metrics. Our experiments of AHM with synthetic dataset that consists of 3D realisations of channelised geological representations with two distinct scenarios with one and two channels shows the viability of the approach. We offer in-depth analysis of the latent space using tools such as PCA, t-SNE, and TDA to illustrate its structure."
  },
  {
    "title": "Recursive Feasibility without Terminal Constraints via Parent-Child MPC Architecture",
    "url": "http://arxiv.org/abs/2507.10166v1",
    "arxiv_id": "2507.10166v1",
    "authors": [
      "Filip Surmaa",
      "Anahita Jamshidnejad"
    ],
    "published": "2025-07-14T11:26:59+00:00",
    "summary": "This paper proposes a novel hierarchical model predictive control (MPC) framework, called the Parent-Child MPC architecture, to steer nonlinear systems under uncertainty towards a target set, balancing computational complexity and guaranteeing recursive feasibility and stability without relying on conservative terminal constraints in online decision-making. By coupling a small-horizon Child MPC layer with one or more large-horizon Parent MPC layers, the architecture ensures recursive feasibility and stability through adjustable stage-wise constraints derived from tube-based control. As is demonstrated in our case studies, compared to traditional MPC methods, the proposed Parent-Child MPC architecture enhances performance and computational efficiency, reduces conservativeness, and enables scalable planning for certain nonlinear systems."
  }
]